Revit 2024 API
RebarBendingDetailType.OrthogonalAndOverallDimesionsEnabled Property
 Identifies if orthogonal and overall dimensions are displayed.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool OrthogonalAndOverallDimesionsEnabled { get; set; }
Visual Basic
Public Property OrthogonalAndOverallDimesionsEnabled As Boolean
	Get
	Set
Visual C++
public:
property bool OrthogonalAndOverallDimesionsEnabled {
	bool get ();
	void set (bool value);
}
Remarks
 Orthogonal segment length dimensions are dimensions defining the slope of a bar segment. Overall dimensions are dimensions that spans over multiple segments.
See Also
RebarBendingDetailType Class
Autodesk.Revit.DB.Structure Namespace